### Criando Banco de Dados SQLAlchemy

In [2]:
#!pip3 install sqlalchemy

In [8]:
import pandas as pd
from sqlalchemy import create_engine, MetaData, Table

In [5]:
engine = create_engine('sqlite:///:memory:')

In [6]:
type(engine)

sqlalchemy.engine.base.Engine

In [9]:
matriculas_por_curso = pd.read_csv('matriculas_por_curso.csv')

In [43]:
matriculas = pd.read_csv('matriculas.csv')

In [48]:
nomes = pd.read_csv('nomes.csv')

In [61]:
cursos = pd.read_csv('cursos.csv')

In [10]:
matriculas_por_curso.to_sql('matriculas', engine)

20

In [11]:
print(engine.table_names())

['matriculas']

C:\Users\72160\AppData\Local\Temp\ipykernel_5716\1043810782.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  print(engine.table_names())

### Criando query para busca

In [12]:
query = 'select * from matriculas where quantidade_de_alunos < 20'

In [13]:
pd.read_sql(query, engine)

   index  quantidade_de_alunos        nome_do_curso
0     11                    18      Hardware básico
1     13                     1  Desenvolvendo jogos
2     15                    10   Estatística básica

In [14]:
pd.read_sql_table('matriculas', engine, columns=['nome_do_curso', 'quantidade_de_alunos'])

                          nome_do_curso  quantidade_de_alunos
0                 Lógica de programação                    37
1                         Java para Web                    75
2                           C# para Web                    43
3                         Ruby on Rails                    60
4                      Cursos de Python                    50
5                         PHP com MySql                    59
6                         .NET para web                    20
7            Novas integrações com Java                    20
8                          TDD com Java                    57
9                   Código limpo com C#                    55
10  Preparatório para certificação Java                    21
11                      Hardware básico                    18
12                Persistência com .NET                    39
13                  Desenvolvendo jogos                     1
14                     Análise de dados                    41
15                   Estatística básica                    10
16                  Internet das coisas                    75
17                Programação funcional                    41
18                Boas práticas em Java                    55
19          Orientação objetos com Java                    22

In [34]:
muitas_matriculas = pd.read_sql_table('matriculas', engine, columns=['nome_do_curso', 'quantidade_de_alunos'])

In [37]:
muitas_matriculas.query('quantidade_de_alunos > 70')

          nome_do_curso  quantidade_de_alunos
1         Java para Web                    75
16  Internet das coisas                    75

In [38]:
muitas_matriculas = muitas_matriculas.query('quantidade_de_alunos > 70')
muitas_matriculas

          nome_do_curso  quantidade_de_alunos
1         Java para Web                    75
16  Internet das coisas                    75

In [39]:
muitas_matriculas.to_sql('muitas_matriculas', con=engine)

2

In [40]:
print(engine.table_names())

['matriculas', 'muitas_matriculas']

C:\Users\72160\AppData\Local\Temp\ipykernel_5716\1043810782.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  print(engine.table_names())

### Nomes novos

In [41]:
matriculas_por_curso.head()

   quantidade_de_alunos          nome_do_curso
0                    37  Lógica de programação
1                    75          Java para Web
2                    43            C# para Web
3                    60          Ruby on Rails
4                    50       Cursos de Python

In [44]:
matriculas.head()

   id_aluno  id_curso
0        59         9
1       372        13
2       372        10
3       372        15
4       180        16

In [54]:
id_curso = 16
proxima_turma = matriculas.query("id_curso == {}".format(id_curso))

In [55]:
proxima_turma.head()

     id_aluno  id_curso
4         180        16
367       175        16
403         9        16
442       296        16
538        43        16

In [56]:
nomes.sample(3)

,nome,id_aluno,dominio,email,matriculas
168,IARA,369,@dominiodoemmail.com.br,iara@dominiodoemmail.com.br,4
57,DAIANE,179,@dominiodoemmail.com.br,daiane@dominiodoemmail.com.br,1
341,ORLANDO,14,@servicodoemail.com,orlando@servicodoemail.com,2

In [57]:
proxima_turma.set_index('id_aluno').join(nomes.set_index('id_aluno'))

,id_curso,nome,dominio,email,matriculas
id_aluno,,,,,
180,16,FRANCISCA,@dominiodoemmail.com.br,francisca@dominiodoemmail.com.br,4
175,16,CLEONICE,@dominiodoemmail.com.br,cleonice@dominiodoemmail.com.br,2
9,16,ISADORA,@dominiodoemmail.com.br,isadora@dominiodoemmail.com.br,1
296,16,FABIO,@dominiodoemmail.com.br,fabio@dominiodoemmail.com.br,1
43,16,WILSON,@servicodoemail.com,wilson@servicodoemail.com,1
265,16,HELIO,@servicodoemail.com,helio@servicodoemail.com,6
161,16,ADAO,@dominiodoemmail.com.br,adao@dominiodoemmail.com.br,3
261,16,VALMIR,@dominiodoemmail.com.br,valmir@dominiodoemmail.com.br,6
18,16,MURILO,@dominiodoemmail.com.br,murilo@dominiodoemmail.com.br,3
257,16,ALBERTO,@dominiodoemmail.com.br,alberto@dominiodoemmail.com.br,3

In [58]:
proxima_turma.set_index('id_aluno').join(nomes.set_index('id_aluno'))['nome']

id_aluno
180    FRANCISCA
175     CLEONICE
9        ISADORA
296        FABIO
43        WILSON
265        HELIO
161         ADAO
261       VALMIR
18        MURILO
257      ALBERTO
Name: nome, dtype: object

In [59]:
proxima_turma = proxima_turma.set_index('id_aluno').join(nomes.set_index('id_aluno'))['nome'].to_frame()
proxima_turma

               nome
id_aluno
180       FRANCISCA
175        CLEONICE
9           ISADORA
296           FABIO
43           WILSON
265           HELIO
161            ADAO
261          VALMIR
18           MURILO
257         ALBERTO

In [62]:
nome_curso = cursos.loc[id_curso]
nome_curso

nome_do_curso    Internet das coisas
Name: 16, dtype: object

In [63]:
nome_curso = nome_curso.nome_do_curso
nome_curso

'Internet das coisas'

In [64]:
proxima_turma.rename(columns = {'nome':'Alunos do curso de {}'.format(nome_curso)})

         Alunos do curso de Internet das coisas
id_aluno
180                                   FRANCISCA
175                                    CLEONICE
9                                       ISADORA
296                                       FABIO
43                                       WILSON
265                                       HELIO
161                                        ADAO
261                                      VALMIR
18                                       MURILO
257                                     ALBERTO

In [65]:
proxima_turma = proxima_turma.rename(columns = {'nome':'Alunos do curso de {}'.format(nome_curso)})

### Exportando para Excel

In [66]:
proxima_turma.to_excel('proxima_turma.xlsx', index = False)

In [67]:
pd.read_excel('proxima_turma.xlsx')

  Alunos do curso de Internet das coisas
0                              FRANCISCA
1                               CLEONICE
2                                ISADORA
3                                  FABIO
4                                 WILSON
5                                  HELIO
6                                   ADAO
7                                 VALMIR
8                                 MURILO
9                                ALBERTO